# Этап 1: Сборка зависимостей

#задаём базовый (родительский) образ
FROM python:3.9-slim as builder

#задаём рабочую директорию для следующей инструкции
WORKDIR /app
#копируем в контейнер файлы и папки
COPY requirements.txt .
# создаём слой образа и устанавливаем в контейнер пакеты
RUN set -e && pip install --user --no-cache-dir -r requirements.txt

# Этап 2: Финальный образ

#задаём базовый (родительский) образ
FROM python:3.9-slim

# задаём рабочую директорию для следующей инструкции
WORKDIR /app
#копируем из первого образа (сборка зависимостей)
COPY --from=builder /root/.local /root/.local
COPY . .
#устанавливаем постоянные переменные среды
ENV PATH=/root/.local/bin:$PATH
#указываем на необходимость открыть порт
EXPOSE 1301
#oписываем команду с аргументами, которую нужно выполнить когда контейнер будет запущен
CMD ["python", "main.py"]